# Table of Contents

## 1. Importing libraries
## 2. Importing data
## 3. Cleaning orders data
## 4. Merging 'prior orders' and 'orders data'
## 5. Exporting merged data

### 1. Importing libraries

In [1]:
# Importing libraries

import pandas as pd
import numpy as np
import os

### 2.Importing data

In [2]:
# Path shortcut
path = r'/Users/lynnsey/Desktop/Bootcamp/Tasks/Immersion/Task 4/07-20-2023 Instacart Basket Analysis'

In [3]:
# Import prior orders data
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'), index_col = False)

In [4]:
# Import orders data
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked_wrangled.csv'), index_col = False)

In [5]:
# Check output for prior orders

df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [6]:
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,time_ordered,days_since_prior_order
0,0,0,2539329,1,prior,1,2,8,NaN
1,1,1,2398795,1,prior,2,3,7,15.0
2,2,2,473747,1,prior,3,3,12,21.0
3,3,3,2254736,1,prior,4,4,7,29.0
4,4,4,431534,1,prior,5,4,15,28.0

### 3. Cleaning orders data

In [7]:
#drop the column that contains "Unnamed" in column name

df_ords = df_ords.drop("Unnamed: 0", axis=1)

In [8]:
df_ords.head()

,Unnamed: 0.1,order_id,user_id,eval_set,order_number,orders_day_of_week,time_ordered,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0

In [9]:
#drop the column that contains "Unnamed 0.1" in column name

df_ords = df_ords.drop("Unnamed: 0.1", axis=1)

In [10]:
df_ords.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,time_ordered,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [11]:
#drop the column that contains "eval_set" in column name

df_ords = df_ords.drop("eval_set", axis=1)

In [12]:
# Checking output of orders data

df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,time_ordered,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [13]:
# Checking dimensions of prior orders data

df_ords_prior.shape

(32434489, 4)

In [14]:
# Checking dimensions of orders data

df_ords.shape

(3421083, 6)

### 4. Merging 'prior orders' and 'orders' data

In [15]:
# Inner merge of prior orders and orders data

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [16]:
# Checking merged data

df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,time_ordered,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [17]:
#Checking to see how many rows are merged together

df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

### 5. Exporting merged data

In [18]:
# Export data to pkl

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))